{
  "pages": [
    {
      "link": "/dashboard",
      "title": "Dashboard",
      "description": "Main overview page showing key metrics, recent activities, and quick access to budget transfer operations"
    },
    {
      "link": "/",
      "title": "Transfers",
      "description": "This is the main page for viewing all transfer operations related to Fund Adjustment Requests (FAR) modifications It. You can also use this page to create or update FAR transfers. Additionally, it allows you to track ERP workflows and accept budget transfer approvals associated with FAR codes. also View detailed information about a specific contract including terms, status, and transaction history with FAR codes."
    },
    {
      "link": "/settlements",
      "title": "Settlements",
      "description": "This is the main page for viewing all transfer operations related to Fund Adjustment Department (FAD) modifications It. You can also use this page to create or update FAD transfers. Additionally, it allows you to track ERP workflows and accept budget transfer approvals associated with FAD codes. also View detailed information about a specific contract including terms, status, and transaction history with FAD codes."
    },
    {
      "link": "/enhancements",
      "title": "Enhancements",
      "description": "This is the main page for viewing all transfer operations related to Additional Fund Requests (AFR) modifications It. You can also use this page to create or update AFR transfers. Additionally, it allows you to track ERP workflows and accept budget transfer approvals associated with AFR codes. also View detailed information about a specific contract including terms, status, and transaction history with AFR codes."
    },
    {
      "link": "/contracts-pending-approval",
      "title": "Contracts Pending Approval",
      "description": "Review and approve or reject pending contract requests for Fund Adjustment Requests (FAR)"
    },
    {
      "link": "/settlements-pending-approval",
      "title": "Settlements Pending Approval",
      "description": "Review and approve or reject pending contract requests for Fund Adjustment Department (FAD)"
    },
    {
      "link": "/transfers-pending-approval",
      "title": "Enhancements Pending Approval",
      "description": "Review and approve or reject pending contract requests for Additional Fund Requests (AFR)"
    },
    {
      "link": "/notifications",
      "title": "Notifications",
      "description": "View system notifications, alerts, and updates related to your transfers and approvals"
    },
    {
      "link": "/admin/user-management",
      "title": "User Management",
      "description": "Administrative interface for managing user accounts, roles, and permissions"
    },
    {
      "link": "/admin/account-entity-management",
      "title": "Account Entity Management",
      "description": "Manage organizational accounts and entity structures for budget allocation"
    },
    {
      "link": "/admin/accounts-entity-view",
      "title": "Accounts Entity View",
      "description": "Comprehensive view of all account entities and their relationships within the organization"
    }
  ]
}
