{
  "pages": [
    {
      "link": "/dashboard",
      "title": "Dashboard",
      "description": "DASHBOARD - MINISTRY OF FINANCE BUDGET TRANSFER ANALYTICS & MONITORING SYSTEM: This is the central command center providing comprehensive real-time insights, statistical analysis, and visual representations of all budget transfer activities across FAR, AFR, and FAD types. The dashboard serves executive and departmental managers with critical insights into budget flow patterns, approval bottlenecks, performance metrics, and financial trends through advanced analytics and intuitive visualizations including transfer status analytics, type distribution breakdowns, approval pipeline monitoring, and financial flow visualization.\n\nThe dashboard features six primary sections: Executive Metrics Overview (approved/rejected/pending/total transfers with trend indicators), Transfer Type Breakdown Analysis (FAR/AFR/FAD volume percentages and comparative charts), Interactive Transfer Flow Visualization (monthly trends, seasonal analysis, and forecasting), Approval Levels Monitoring (Level 1-4 processing metrics and bottleneck identification), Cost Center Distribution Network (fund movement patterns and connection mapping), and Comprehensive Transfer Analysis with four sub-views: Filtered Combinations (cost center/account code cross-analysis), Cost Center Totals (departmental summaries), Account Code Totals (budget line analysis), and All Combinations (complete matrix analysis).\n\nReal-time monitoring features include live data updates with automatic refresh, alert systems for unusual patterns and threshold breaches, performance indicators with color-coded status and trend arrows, and analytical insights for operational efficiency, financial oversight, and strategic planning. The interface supports interactive exploration with drill-down capabilities, data export and reporting, customization options, full Arabic/English language support with RTL layout, accessibility compliance, and responsive design for mobile/tablet/desktop access."
    },
    {
      "link": "/",
      "title": "Transfers",
      "description": "FUND ADJUSTMENT REQUESTS (FAR) - PRIMARY TRANSFER TYPE: This system handles internal budget adjustments and fund movements within the Ministry of Finance for routine budget management operations. FAR transfers reallocate funds between budget line items within the same fiscal year, requiring departmental manager approval with 3-5 business days processing time. Use cases include moving unused budget between departments, adjusting allocations based on actual needs, and transferring surplus funds to priority projects, with restrictions not exceeding 20% of original allocation without executive approval.\n\nCore functionalities include comprehensive Transfer Management (create, edit, delete, view details, and track status), advanced Search & Filtering (real-time search, status/date filtering, smart suggestions, and export capabilities), Approval Pipeline Tracking (visual workflow representation, real-time updates, notifications, and Oracle integration), Document Management (upload, version control, preview/download, and automated validation), and Reporting & Analytics (generate reports, budget analytics, performance metrics, audit trails, and custom reports).\n\nUser interactions feature intuitive interfaces for Viewing Transfers (paginated sortable tables with status color-coding and responsive design), Creating Transfers (modal forms with validation, step-by-step wizard, auto-save, and templates), Editing Transfers (inline/full editing with change tracking and approval reset), and Progress Tracking (visual pipeline, email notifications, comment system, and completion estimates). Each transfer record contains Transaction ID, Code, Requested By, Description, Request/Transaction Dates, Status, Attachments, Approval Pipeline position, and Rejection Reason details."
    },
    {
      "link": "/settlements",
      "title": "Settlements",
      "description": "ADDITIONAL FUND REQUESTS (AFR) - ENHANCEMENT FUNDING: This system handles enhancement requests for supplementary funding beyond original budget allocations, designed for exceptional funding requirements. AFR transfers request additional funds for projects requiring budget increases, including emergency funding, project scope expansion, inflation adjustments, unexpected operational costs, and new regulatory requirements. These require executive approval and budget committee review with 7-14 business days processing time, subject to reserve fund availability and fiscal year constraints.\n\nCore functionalities mirror FAR systems but with enhanced complexity: Transfer Management (create, edit, delete, view, track), Search & Filtering (real-time search, advanced filtering, smart suggestions, export), Approval Pipeline Tracking (visual workflow, real-time updates, notifications, Oracle integration), Document Management (upload, version control, preview/download, validation), and Reporting & Analytics (reports, budget analytics, performance metrics, audit trails, custom reports). The system requires detailed business cases, cost-benefit analysis, and risk assessments due to strategic impact.\n\nUser interactions include comprehensive interfaces for Viewing Transfers (paginated tables with status indicators), Creating Transfers (modal forms with validation and wizards), Editing Transfers (inline/full editing with tracking), and Progress Tracking (visual pipeline and notifications). Each transfer maintains complete data structure with Transaction ID, Code, Requested By, Description, dates, Status, Attachments, Approval Pipeline, and Rejection Reasons, serving as the central hub for enhancement funding requests within the Ministry of Finance ecosystem."
    },
    {
      "link": "/enhancements",
      "title": "Enhancements",
      "description": "FUND ADJUSTMENT DEPARTMENT (FAD) - SETTLEMENT TRANSFERS: This system handles departmental settlement transfers for final budget reconciliation and closure, designed for fiscal accountability and audit compliance. FAD transfers manage final budget settlements, year-end adjustments, and account reconciliation including fiscal year-end closures, inter-departmental debt settlements, budget variance reconciliation, and audit adjustment entries. These require accounting department and audit approval with 10-21 business days processing time, adhering strictly to accounting standards and audit requirements.\n\nCore functionalities encompass comprehensive Transfer Management (create, edit, delete, view, track), Search & Filtering (real-time search, advanced filtering, suggestions, export), Approval Pipeline Tracking (visual workflow, updates, notifications, Oracle integration), Document Management (upload, version control, preview/download, validation), and Reporting & Analytics (reports, analytics, metrics, audit trails, custom reports). The system emphasizes reconciliation reports, audit trails, and settlement agreements due to compliance focus.\n\nUser interactions provide specialized interfaces for Viewing Transfers (paginated tables with status coding), Creating Transfers (modal forms with validation), Editing Transfers (inline/full editing with tracking), and Progress Tracking (visual pipeline and notifications). Each transfer maintains detailed records including Transaction ID, Code, Requested By, Description, Request/Transaction Dates, Status, Attachments, Approval Pipeline position, and Rejection Reasons, serving as the central hub for settlement transfers and reconciliation within the Ministry of Finance ecosystem."
    },
    {
      "link": "/contracts-pending-approval",
      "title": "Contracts Pending Approval",
      "description": "FAD PENDING APPROVAL - ADMINISTRATIVE REVIEW CENTER: This read-only administrative interface is exclusively designed for authorized accounting and audit personnel to review, evaluate, and process Fund Adjustment Department (FAD) settlement transfers awaiting approval. The page displays only FAD settlements in pending status, focusing on final budget settlements, year-end adjustments, and account reconciliation that require accounting department and audit approval with high processing complexity and strict compliance requirements.\n\nCore administrative functionalities include Pending Transfer Queue Management (chronological viewing, priority sorting, aging analysis, workload distribution), Detailed Transfer Examination (comprehensive details, documentation review, reconciliation analysis, audit trail examination), Approval Workflow Processing (individual/batch approval, rejection with reasoning, information requests, escalation), Compliance and Audit Features (automated compliance checking, risk assessment, regulatory verification), and Communication/Collaboration (internal notes, requester communication, decision notifications, collaborative review).\n\nThe interface provides advanced capabilities including filtering and search by amount/date/department, approval decision tools with quick/detailed approval forms and bulk actions, document review with integrated viewer and annotation tools, analytics and reporting for performance metrics and compliance, approval authority levels from accounting review to senior management escalation, Oracle system connectivity, notification systems, comprehensive audit trails, role-based access control, and performance monitoring for processing efficiency and quality assurance."
    },
    {
      "link": "/settlements-pending-approval",
      "title": "Settlements Pending Approval",
      "description": "AFR PENDING APPROVAL - EXECUTIVE REVIEW CENTER: This read-only executive-level interface is exclusively designed for senior management and budget committee members to review and process Additional Fund Requests (AFR) requiring executive approval. The page displays only AFR enhancement requests in pending status awaiting executive decision, focusing on supplementary funding for budget increases with very high processing complexity and significant strategic impact on overall budget strategy and resource allocation.\n\nCore executive review functionalities include Strategic Request Evaluation (business case analysis, cost-benefit assessment, risk review, strategic alignment, budget impact), Budget Committee Workflow (meeting preparation, collaborative review, voting tools, decision documentation), Executive Decision Processing (high-level approval authority, policy compliance, reserve fund assessment, multi-level authorization), Fiscal Responsibility Oversight (budget impact analysis, cash flow assessment, sustainability analysis), and Strategic Planning Integration (alignment verification, resource optimization, priority ranking, portfolio management).\n\nThe executive interface features strategic dashboard views with summary cards and KPIs, comprehensive business case review with financial projections and risk matrices, collaborative decision tools with discussion forums and consensus tracking, advanced analytics with predictive intelligence, approval authority hierarchy from departmental executive to senior authorization, strategic evaluation criteria for business justification and financial viability, comprehensive risk management and governance compliance, executive reporting with decision summaries and performance tracking, and complete audit documentation for accountability and regulatory requirements."
    },
    {
      "link": "/transfers-pending-approval",
      "title": "Enhancements Pending Approval",
      "description": "FAR PENDING APPROVAL - DEPARTMENTAL MANAGEMENT CENTER: This read-only departmental interface is exclusively designed for departmental managers and supervisory personnel to review and process Fund Adjustment Requests (FAR) awaiting managerial approval. The page displays only FAR budget adjustment transfers in pending status for routine budget management operations, focusing on internal budget reallocations between cost centers requiring departmental manager approval with standard processing complexity and high-volume daily operations.\n\nCore departmental approval functionalities include Operational Transfer Queue Management (departmental approval viewing, priority organization, daily workflow management, workload distribution), Routine Budget Adjustment Review (line item validation, cost center authorization, budget impact assessment, operational necessity verification), Departmental Approval Workflow (single-click approval, batch processing, rejection with feedback, clarification requests, escalation), Budget Management Oversight (utilization monitoring, allocation efficiency tracking, spending analysis, variance control), and Operational Efficiency Tools (fast-track approval, template-based processing, automated compliance checking, performance metrics).\n\nThe departmental interface provides manager-focused dashboards with department-specific queues and quick action buttons, operational decision support with budget calculators and trend analysis, streamlined approval processing with one-click and bulk capabilities, departmental analytics for volume and efficiency tracking, approval authority structure from departmental manager to senior management escalation, operational efficiency features including fast-track processing and productivity optimization, compliance and governance with policy checking and audit trails, workflow integration with real-time system connectivity, and performance monitoring for operational metrics and continuous improvement."
    },
    {
      "link": "/notifications",
      "title": "Notifications",
      "description": ""
    },
    {
      "link": "/admin/user-management",
      "title": "User Management",
      "description": "USER MANAGEMENT - COMPREHENSIVE SYSTEM ADMINISTRATION: This administrative interface provides complete control over user accounts, role assignments, and organizational structure management within the budget transfer system. The page is organized into three distinct sections accessible through tab navigation: Users Management (complete user account lifecycle), User Levels Management (approval hierarchy administration), and Level Assignments (user-level relationship management). Each section provides specialized functionality for different aspects of user administration, ensuring proper organizational hierarchy implementation and role-based access control.\n\nUsers Management Section features comprehensive user account administration including complete user directory display with real-time status visibility, advanced search and filtering by roles/levels with export capabilities, new user account creation with secure password management and role assignment, user account modification for username/role updates and security management, and user account removal with secure deletion and data retention procedures. The interface includes user directory tables showing username/role/level/actions, search and filter controls with real-time functionality, and user statistics with distribution analytics.\n\nUser Levels Management Section administers the organizational approval hierarchy structure governing budget transfer workflows, providing centralized control over approval levels, descriptions, and hierarchical ordering. Features include approval level directory management with hierarchical displays, level configuration for name/description updates and order adjustment, and organizational hierarchy maintenance with sequence validation and dependency management. Level Assignments Section manages user-level relationships through interactive assignment interfaces with real-time validation, organizational structure visualization with hierarchical displays, assignment validation and conflict resolution, and dynamic assignment management with immediate workflow impact, serving as the foundational tool for maintaining organizational structure and approval workflow integrity."
    },
    {
      "link": "/admin/account-entity-management",
      "title": "Account Entity Management",
      "description": "ACCOUNT ENTITY MANAGEMENT - TRANSFER RESTRICTIONS & PERMISSIONS CONTROL: This administrative interface provides comprehensive control over account-entity combinations and their transfer permissions within the budget transfer system. The system manages the fundamental building blocks of all financial transactions, where every transfer moves funds from one account-entity combination to another. Administrators can configure detailed restrictions and permissions that govern which accounts can serve as sources, targets, or participate in transfers at all, ensuring compliance with organizational policies and financial regulations.\n\nThe page features a two-stage interface design: Entity Selection (dropdown combo box displaying all available cost center entities with alias names for easy identification) and Account Management Table (comprehensive listing of all accounts within the selected entity showing ID, Account number, Source Allowed status, Target Allowed status, Transfer Allowed status, and Edit actions). The system displays pagination controls when dealing with large account sets, showing 10 accounts per page with navigation between pages, and provides real-time filtering and search capabilities for efficient account location and management.\n\nCore administrative functionalities include Account Restriction Configuration (modify Source Allowed permissions to control whether accounts can initiate transfers, adjust Target Allowed permissions to determine if accounts can receive transfers, set Transfer Allowed status for overall transfer participation), Permission Management (granular control over account-level transfer capabilities, bulk permission updates for multiple accounts, audit trail maintenance for all permission changes), and System Integration (real-time synchronization with transfer processing systems, validation checks to prevent conflicting permissions, automatic enforcement of restrictions during transfer creation and processing). The interface supports full Arabic/English localization with RTL layout, responsive design for various devices, and comprehensive audit logging for compliance and accountability purposes."
    },
    {
      "link": "/admin/accounts-entity-view",
      "title": "Accounts Entity View",
      "description": "ACCOUNTS ENTITY VIEW - COMPREHENSIVE DATA MANAGEMENT INTERFACE: This administrative interface provides complete management capabilities for both account and entity data within the budget transfer system. The page serves as the central hub for viewing, creating, editing, and deleting the fundamental data structures that form the backbone of all financial transactions. It offers a dual-section design with separate management areas for accounts and entities, each providing full CRUD (Create, Read, Update, Delete) operations with advanced search and filtering capabilities.\n\nThe interface features a two-section tabbed design accessible via top navigation buttons: Accounts Section (comprehensive account management with table display showing Account Code, Parent, and Alias fields, individual edit/delete action buttons, Add Account button for new entries, and real-time search functionality) and Entities Section (complete entity management with table display showing Entity Code, Parent, and Alias fields, individual edit/delete action buttons, Add Entity button for new entries, and real-time search functionality). Both sections include pagination controls for large datasets, loading indicators during data operations, and confirmation dialogs for delete operations to prevent accidental data loss.\n\nCore management functionalities include Data Visualization (paginated tables with sortable columns, status indicators, and responsive design), Search and Filtering (real-time search input across all fields, instant results filtering, search result counts with filter indicators), CRUD Operations (modal-based forms for creating new accounts/entities with validation, inline edit capabilities with pre-populated forms, secure delete operations with confirmation dialogs, form validation and error handling), and Data Integrity (parent-child relationship management, alias naming conventions, unique code enforcement, audit trail for all modifications). The interface supports full Arabic/English localization with RTL layout, dark/light theme modes, responsive design for various devices, and comprehensive error handling for robust data management operations."
    }
  ]
}
